docs/CHANGES.org
#+TITLE: CHANGES of Copris
#+AUTHOR: <a href='http://bach.istc.kobe-u.ac.jp/tamura.html'>Naoyuki Tamura</a>
#+EMAIL: 
#+STARTUP: overview hidestars nologdone
#+LANGUAGE: en
#+OPTIONS: toc:t H:3 num:nil author:t creator:t todo:nil pri:nil tags:nil LaTeX:t ^:t @:t
#+STYLE: <link rel="stylesheet" type="text/css" href="/include/org-common.css">
#+STYLE: <link rel="stylesheet" type="text/css" href="/include/org-toc-right.css">
#+INFOJS_OPT: view:showall toc:t tdepth:2 ltoc:nil mouse:#ffffcc path:/include/org-info.js
#+MATHJAX: align:"left" mathml:nil path:"/include/mathjax/MathJax.js"
# #+INCLUDE: menu.txt
* Overview
  This document describes the major changes of
  [[http://bach.istc.kobe-u.ac.jp/copris/][Copris]] (Constraint Programming in Scala).
* Version 2.1.0 [2013-09-01 Sun]
  - Copris version 2.1.0 uses Sugar version 2.1.0 and Sat4j version 2.3.5.
  - 'solutions' method is added to get an iterator of all solutions.
  - 'boolInt' method is added to declare 0-1 integer variables.
  - Implicit conversion from Symbol to Constraint is added in Copris DSL.
    : boolInt('x)
    : boolInt('y)
    : add('x || 'y)
    : add('x + 'y === 1)
* Version 2.0.0 [2013-02-15 Fri]
  - Using Sugar version 2.0.0 and Sat4j version 2.3.3
  - Jar files of Sugar and Sat4j are included to Copris package
* Version 1.0.3 [2012-06-08 Fri]
  - Names of temporary variables are changed
* Version 1.0.2 [2012-06-08 Fri]
  - Performance improvement for adding variables and constraints
* Version 1.0.1 [2011-09-11 Sun]
  - ~value~ and ~values~ methods of solvers are now deprecated.
    Use ~apply~ methods of ~Solution~ class instead.
    : if (find)
    :   println(solution(x))   // instead of println(value(x))
  - Dot product operator of ~Vec~ is changed from ~*+~ to ~:*~.
  - value method is defined in ~Term~ and ~Constraint~ classes.
    : if (find)
    :   println((x + 1).value(solution))
  - Anonymous variables can be created by ~Var()~ and ~Bool()~.
    - Names like ~_1~, ~_2~, etc. are used for anonymous variables.
* Version 1.0.0 [2011-08-28 Sun]
  - Release of the first version.
